[
  {
    "id": "wtei-inc-mansion",
    "title": "Puerto Princesa City, Abueg Road Kitchen Bathroom",
    "location": "Bancao Bancao, Puerto Princesa City, Palawan",
    "year": "2022",
    "type": "Mansion",
    "description": "**Elevate Your Space with Petg Glass Board Carcasses in Lavatory Cabinets**\r\n\r\nWhen it comes to enhancing the functionality and aesthetic appeal of your bathroom, choosing the right materials for your lavatory cabinets is paramount. One innovative option that stands out is the use of PETG glass board carcasses. This modern material not only offers a sleek appearance but also delivers several practical benefits that can transform your lavatory space.\r\n\r\nPETG glass board carcasses are known for their durability and resistance to moisture, making them an ideal choice for high-humidity environments like bathrooms. Unlike traditional wood or MDF materials that can warp or swell, PETG maintains its integrity over time, ensuring your cabinets remain as beautiful as the day they were installed. Additionally, the glass-like finish presents a contemporary look that can elevate the overall design of your lavatory, providing a clean and sophisticated appearance that complements any decor style.\r\n\r\nMoreover, the ease of maintenance that PETG glass board carcasses offer is a significant advantage. Their non-porous surface resists stains and is easy to wipe clean, allowing you to maintain a pristine environment with minimal effort. This is particularly beneficial in lavatory spaces where cleanliness is essential. By opting for cabinets constructed with this cutting-edge material, you’re not only investing in long-lasting quality but also in a solution that simplifies your daily routine.\r\n\r\nIf you're ready to upgrade your bathroom with stylish and durable lavatory cabinets, consider the advantages of PETG glass board carcasses. Our expert team is here to guide you through the selection process and help you create a space that reflects your personal style while meeting your practical needs. \r\n\r\nContact us today to explore our range of lavatory cabinets and discover how you can enhance your home with innovative materials.",
    "image": "https://res.cloudinary.com/dbviya1rj/image/upload/v1763230884/mnaxvkblij98d2yppmav.jpg",
    "images": [
      "https://res.cloudinary.com/dbviya1rj/image/upload/v1763230886/xltvl2buitsribfarsiv.jpg",
      "https://res.cloudinary.com/dbviya1rj/image/upload/v1763230885/unl7nmyksifzp3xdghvs.jpg"
    ],
    "services": [
      "Lavatory Cabinets",
      "Walk-in Closet"
    ]
  },
  {
    "id": "rizal-avenue-penthouse",
    "title": "Puerto Princesa City, Rizal Avenue Penthouse Kitchen Project",
    "location": "Rizal Avenue, Puerto Princesa City, Palawan",
    "year": "2022",
    "type": "Penthouse",
    "description": "**Elevate Your Space with Premium Cabinet Solutions**\r\n\r\nWhen it comes to designing a functional and stylish kitchen or bathroom, the materials you choose play a crucial role in achieving both durability and aesthetic appeal. One standout option for modern cabinetry is the use of PETG glass boards for doors. Unlike traditional glass, PETG is a lightweight, shatter-resistant material that provides a sleek, contemporary look while ensuring safety, especially in homes with pets or children. Its clarity and gloss finish allow for seamless integration with any design, creating a sophisticated ambiance.\r\n\r\nIn addition to visual appeal, the choice of materials like melamine marine plywood significantly enhances the longevity of your cabinets. This type of plywood is engineered to withstand moisture and humidity, making it an ideal choice for kitchens and bathrooms. Combined with premium quartz countertops, which are not only visually striking but also highly resistant to scratches and stains, you can create an environment that's both beautiful and practical. The non-porous surface of quartz means less maintenance and more time enjoying your space.\r\n\r\nFinally, don’t overlook the importance of high-quality pull handles. These small details can make a big difference in both functionality and style. Investing in well-crafted pull handles elevates the overall look of your cabinetry and ensures that your cabinets can withstand frequent use without compromising on design. \r\n\r\nIn conclusion, selecting the right components for your cabinetry can transform your space into a stylish and durable haven. From the modern appeal of PETG glass doors to the resilience of melamine marine plywood and the elegance of premium quartz, every choice counts. Ready to take your cabinetry to the next level? Contact us today to explore our range of high-quality cabinet solutions tailored to your needs!",
    "image": "https://res.cloudinary.com/dbviya1rj/image/upload/v1763228651/y3wqoymderb4sh87eh3j.jpg",
    "images": [
      "https://res.cloudinary.com/dbviya1rj/image/upload/v1763228650/k692dzpodzn1jg8y5r8p.jpg",
      "https://res.cloudinary.com/dbviya1rj/image/upload/v1763228649/buuafzgztbrlwllolvys.jpg"
    ],
    "services": [
      "Kitchen Cabinets",
      "Lavatory Mirror Cabinet"
    ]
  },
  {
    "id": "skylight-hotel-kitchen",
    "title": "Puerto Princesa City, Rizal Avenue Kitchen Project",
    "location": "Rizal Avenue, Palawan",
    "year": "2022",
    "type": "Commercial",
    "description": "**Elevate Your Kitchen Design with Innovative Features**\r\n\r\nWhen it comes to kitchen renovations, functionality and style are paramount. Our Sentir synchronized board doors offer a sleek, modern aesthetic while providing durability that stands the test of time. These doors are engineered with precision, ensuring a seamless look that beautifully complements your kitchen’s design. The synchronized movement not only enhances usability but also adds a touch of sophistication, making your space feel more cohesive and inviting.\r\n\r\nAt the heart of your kitchen's structure is the melamine marine plywood carcass. This material is not only lightweight but also incredibly strong and resistant to moisture, making it an ideal choice for areas that experience high humidity. The combination of our robust carcass with tandem box drawers provides ample storage while ensuring smooth and silent operation. These drawers are designed for easy access and organization, allowing you to keep your kitchen clutter-free and efficient.\r\n\r\nIncorporating a downdraft rangehood into your kitchen design further elevates your cooking experience. This stylish and functional element effectively removes smoke and odors without the need for a bulky overhead hood, maintaining the clean lines of your kitchen. Pair this with an island nook, and you have the perfect spot for casual dining, socializing, or simply enjoying your morning coffee. The island nook not only enhances your kitchen's functionality but also serves as a central gathering point for family and friends.\r\n\r\nReady to transform your kitchen with these innovative features? Contact us today to explore our custom cabinetry solutions and experience the perfect blend of style and functionality. Let’s create the kitchen of your dreams together!",
    "image": "https://res.cloudinary.com/dbviya1rj/image/upload/v1763230412/momirivjqmguvgarjvak.jpg",
    "images": [
      "https://res.cloudinary.com/dbviya1rj/image/upload/v1763230413/sqhkgdoghtk0pyq1yivs.jpg",
      "https://res.cloudinary.com/dbviya1rj/image/upload/v1763230412/nh6ugnu01kg05x7ir637.jpg"
    ],
    "services": [
      "Kitchen Cabinets",
      "Countertop Installation"
    ]
  },
  {
    "id": "garcia-mansion-kitchen",
    "title": "Narra Palawan, Kitchen Project",
    "location": "Narra, Palawan",
    "year": "2022",
    "type": "Mansion",
    "description": "**Elevate Your Space with Premium Cabinet Solutions**\r\n\r\nIn today’s design landscape, quality and sustainability are paramount. Our greenlam laminated doors are an excellent choice for homeowners seeking an environmentally friendly yet stylish option. Made from high-quality laminate, these doors are not only durable but also resistant to scratches and moisture, ensuring that your cabinets maintain their aesthetic appeal over time. The variety of finishes available allows for seamless integration into any interior design scheme, providing both function and flair.\r\n\r\nPairing these doors with a synthetic quartz countertop creates a sophisticated and practical kitchen or bathroom environment. Synthetic quartz is non-porous, meaning it resists stains and is easy to clean, making it an ideal surface for busy households. Additionally, our melamine marine carcass construction ensures that your cabinetry remains robust and resilient against wear and tear. This is particularly important in areas susceptible to humidity and moisture, where traditional materials might falter.\r\n\r\nTo further enhance the elegance and functionality of your cabinets, consider our brass handles and tandem box drawers. The brass handles not only add a touch of luxury but also ensure durability and easy grip. Meanwhile, tandem box drawers provide smooth operation and ample storage space, making organization effortless and efficient. Together, these components create a cohesive and sophisticated look that elevates your space.\r\n\r\nInvesting in quality cabinetry is essential for both aesthetics and functionality. Choose our greenlam laminated doors, synthetic quartz countertops, melamine marine carcass, and stylish hardware to transform your home. Contact us today to explore our full range of options and discover how we can help you create the perfect living space.",
    "image": "https://res.cloudinary.com/dbviya1rj/image/upload/v1763228628/yxtlcshl1tr5rwexkhcs.jpg",
    "images": [
      "https://res.cloudinary.com/dbviya1rj/image/upload/v1763228628/tcn9seit6len2caixjlq.jpg",
      "https://res.cloudinary.com/dbviya1rj/image/upload/v1763228627/iq3yzfsvjai7mnnu1xk7.jpg"
    ],
    "services": [
      "Modular Kitchen",
      "Countertop Installation"
    ]
  },
  {
    "id": "mr-palanca-house",
    "title": "Puerto Princesa City, Wescom Road Kitchen Project",
    "location": "Wescom Road, Puerto Princesa City, Palawan",
    "year": "2023",
    "type": "Bungalow",
    "description": "**Transform Your Kitchen with Premium Cabinet Solutions**\r\n\r\nWhen it comes to designing the perfect kitchen, the choice of materials can make all the difference. One of the standout options we offer is our **Sentir Synchronized Boards Door**, which not only enhances the visual appeal of your cabinets but also provides unmatched durability and functionality. The synchronized texture mimics the natural patterns found in wood, creating a sophisticated look that complements any kitchen style while ensuring long-lasting performance.\r\n\r\nIn addition to the Sentir boards, our cabinets are constructed using **melamine marine plywood**. This material is specifically engineered to resist moisture and humidity, making it ideal for kitchen environments prone to spills and temperature fluctuations. The robustness of marine plywood means your cabinetry will maintain its integrity over time, allowing you to enjoy a beautiful kitchen without the worry of wear and tear.\r\n\r\nTo complete your kitchen transformation, consider pairing our cabinets with a **synthetic quartz countertop**. Quartz is renowned for its resilience, non-porous nature, and ease of maintenance, making it a practical choice for busy kitchens. The combination of our stylish cabinetry and a high-quality countertop creates a cohesive and elegant space that is both functional and aesthetically pleasing.\r\n\r\nInvesting in these premium materials not only enhances the beauty of your kitchen but also increases its value. With the right combination of Sentir synchronized boards, melamine marine plywood, and synthetic quartz countertops, you can create a kitchen that perfectly balances style, durability, and practicality.\r\n\r\nReady to elevate your kitchen? Contact us today to explore our range of cabinet solutions and discover how we can help you design the kitchen of your dreams!",
    "image": "https://res.cloudinary.com/dbviya1rj/image/upload/v1763228570/bgcaoojrvuktnyyzsmlr.jpg",
    "images": [
      "https://res.cloudinary.com/dbviya1rj/image/upload/v1763228570/cekghmc8mp6i7bsgwqwx.jpg",
      "https://res.cloudinary.com/dbviya1rj/image/upload/v1763228570/e7rimmvdhiloiw3xkioh.jpg"
    ],
    "services": [
      "Kitchen Cabinets",
      "Countertop Installation"
    ]
  },
  {
    "id": "contemporary-office-space",
    "title": "Puerto Princesa City, Abueg Road Kitchen Project",
    "location": "Puerto Princesa City, Palawan",
    "year": "2023",
    "type": "Residential",
    "description": "**Elevate Your Kitchen with Graphite PETG Doors and Marine Plywood Carcasses**\r\n\r\nWhen it comes to kitchen cabinets, the choice of materials can significantly influence both aesthetics and durability. Our cabinets featuring **graphite PETG doors** offer a sleek, modern look that is not only visually appealing but also incredibly functional. PETG (polyethylene terephthalate glycol) is known for its resistance to impact and moisture, ensuring that your kitchen remains beautiful and practical for years to come. The rich graphite finish adds a contemporary touch, making your kitchen a stylish focal point in your home.\r\n\r\nThe foundation of our cabinets is built using **marine plywood carcasses**, renowned for their exceptional strength and resistance to warping. Unlike standard plywood, marine-grade plywood is designed to withstand moisture and humidity, making it an ideal choice for kitchen environments. This durability means your cabinets maintain their structural integrity, supporting the weight of heavy items and ensuring longevity without the worry of deterioration over time.\r\n\r\nTo enhance functionality, we incorporate **Hettich hardwares** into our cabinet designs. Hettich is a leader in innovative hardware solutions, providing smooth-running mechanisms and high-quality hinges that ensure your cabinets operate flawlessly. Paired with **premium quartz countertops**, our cabinets create a cohesive and luxurious kitchen space. Quartz is not only stunning but also non-porous, making it resistant to stains and easy to maintain, which is a significant advantage for busy kitchens.\r\n\r\nTransform your kitchen into a functional masterpiece with our expertly crafted cabinets. Experience the perfect combination of style, durability, and innovation by choosing our graphite PETG doors, marine plywood carcasses, and premium finishes. Contact us today to start designing the kitchen of your dreams!",
    "image": "https://res.cloudinary.com/dbviya1rj/image/upload/v1763228546/neaukknuqfws6djd0m5t.jpg",
    "images": [
      "https://res.cloudinary.com/dbviya1rj/image/upload/v1763228546/xs2kbkay8e5ekpopudd9.jpg",
      "https://res.cloudinary.com/dbviya1rj/image/upload/v1763228546/m0yfmysvqgdhwcw2epnb.jpg"
    ],
    "services": [
      "Kitchen Cabinets",
      "Storage Solutions"
    ]
  }
]